s = 'hello world'
print(s)
print(s[6])
print(s[10])
print('kusmiu'[1])
# s[0] первый символ
# s[len(s) - 1] последний символ
# s[-1]
print(s[-1])


# 0  1  2  3  4  5 6  7  8  9 10
# h  e  l  l  o    w  o  r  l  d
#-11 -10  ......           -2  -1

# срезы
print(s[2:6])  # ЛЕВОЕ ЗНАЧЕНИЕ БЕРТСЯ, А ПРАВОЕ НЕТ!
print(s[6: ])  # от какого индекса и до конца строки
print(s[ :5])  # от начала до какого индекса ( не включительно)
print(s[:])    # копия всей строки
print(s[::2])  # все буквы с шагом 2 ( чере 1 букву)
print(s[1::2]) # от 1 индекса до конца строки с шагом 2
print(s[::-1]) # перевернутая строка
print(s[2:8:3]) # от индекса 3 до 7 с шагом 3

# чтобы изменить строку нужно создать новую!
s = s[ :4] + 'u' + s[5: ]
print(s)

