# метод - это функция, связанная с  определённым типом объекта. Методы специфичны для каждого отдельного типа
# Вызов метода:   объект.метод(аргументы)
# любой метод строки не меняет саму строку!


print('hello'.upper()) # все буквы ЗАГЛАВНЫЕ, цифры и знаки не меняются
print('HELLO'.lower()) # все буквы строчные

s = 'hello kitty'
print(s.upper())
#любой метод строки не меняет саму строку! чтобы изменить строку необходимо присвоить! изменения
s = s.upper()
print(s)
s = s.lower()
print(s)

print(s.count('t')) # сколько раз символ встречается в строке
print(s.count('t', 9)) # сколько раз символ встречается в строке с определнного места до конца строки
print(s.count('l', 0, 3)) # сколько раз символ встречается в строке с определнного индекса до определённого индекса. ПРАВЫЙ НЕ ВКЛЮЧЕН

print(s.find('l'))   # индекс подстроки - возвращает индекс символа; если повторяются, то первый слева; если подстроки нет, то возвращает -1
print(s.rfind('y'))  
print(s.index('h'))  # аналогично find но выдаст ошибку если будем искать несуществует подстроку
print(s.replace('o', '%'))  # обязательно 2 аргумента что меняем и на что меняем
print(s.replace('i', ''))   # замена на пустоту, по факту просто убираем букву
print(s.replace(' ', ''))   # убираем пробел
print(s.replace('l', '', 2)) # сколько символов убрать
print(s.isalpha()) # проверка состоит ли строка только из букв
print('1234'.isdigit()) # состоит ли строка только из цифр

d = '111'
print(d.rjust(5)) # дополняет строку СЛЕВА по умолчанию пробелами до длины 5, r тк смещение вправо
print(d.rjust(5, "0")) # дополняет строку СЛЕВА указанным символом
print(d.ljust(5, "2")) # дополняет строку СПРАВА

w = 'ivanov ivan ivanonich'
print(w.split())   # разбивает строку по пробелам в СПИСОК
print(len(w.split())) 
print(w.split('n'))
print(','.join(w.split())) # сначала split делит строку на список из 3 элеметов, а затем join собирает в строку с помощью  запятой

t = '43,25,56,54,121'.split(',')  # получаем СПИСОК
print(t)
print('=='.join(t))  # возвращаем обратно в строку

q = '   hello   \n'
print(q)
print(q.strip()) # удаляет пробелы и перенос на новую строку
print(q.rstrip()) 
print(q.lstrip()) 

k = input().upper()
print(k)




