marks = [1,2,3,4,5]
temp_july = [30, 40, 32, 43]
a = [True, 43, 'hello', 5.4, [4, 5, 6]]

#ОПЕРАЦИИ
print(len([1, 2, 3]))  #лина списка
print(len(a))

print([1,2,3,4,5] + [30, 40, 32, 43]) # сложение списков , нельзя сложить просто с числом

print([1234] + a) # добавление элемента в начало списка

print([0] * 5)   # дублирвоание списка

print(1 in marks)      # проверка вхождения


max(marks)
min(marks)
sum(marks)
sorted(marks)   # сортировка по возрастанию
sorted(marks, reverse=True) # сортировка по убыванию
#print(sorted(marks)) 
[100,54] > [34, 564, 5645]  # сравнение по первым элементам!

#ИНДЕКСЫ И СРЕЗЫ

b = [1,2,56,34,23,12]
print(b[0])   # первое место
print(b[-1])  # последнее место
print(b[1:4]) # c 1 по 4 индекс НЕ ВКЛЮЧАЯ ЕГО
print(b[0:])  # c 0 индекса по последний
print(b[:2])  # c начала по 2 индекс НЕ ВКЛЮЧАЯ ЕГО
print(b[:])  # весь список
print(b[::2])  # весь список с шагом 2
print(b[2:5:2])  # весь список с шагом 2 от 2 до 5 индекса НЕ ВКЛЮЧАЯ ЕГО
print(b[::-1])  # перевернуть список
b[0] = 1000  #изменение 1 элемента списка 
print(b)
b[2:5] = 5000, 6000, 7000
print(b)
del b[0]
print(b)

# если сохранить список с = d, то при изменении любого списка второй тоже будет меняться
# чтобы этого избежать:
c = [1, 2, 3]
d = c[:]
c[0] = 1000
print(c)
print(d)

# МЕТОДЫ СПИСКОВ    #list_. + CTRL + ПРОБЕЛ = показывает все методы!!!!
list_=[1,2,3,4,3,5,6,6]
list_.append(46)  # добавление элемента в конец списка, только ОДИН аргумент
print(list_)
#list_.clear()   # очистка списка
#print(list_)
k = list_.copy()  # копирование спика, это ДВА ОТДЕЛЬНЫХ ОБЪЕКТА
print(k)
print(list_.count(6)) # сколько раз встретилось указанное значение
print(list_.index(1)) # ищет индекс указанного значения, первого найденного
print(list_.index(3,3)) # ищет индекс указанного значения, второй аргумент - с какого индекса начинать поиск
print(list_.index(3,3,5)) # значение, с какого индекса, по какой индекс НЕ ВКЛЮЧАЯ ЕГО
list_.insert(2,1000) # на какой индекс втавить значение
print(list_)
print(list_.pop()) # удаляет с конца значение и показывает его
list_.pop(0)  # удаляет значение по указанному индексу
print(list_)
list_.remove(4)  # удаляет указанное значение
print(list_)

list_.reverse()  #переворачивает список
print(list_)

list_.sort()  # сортировка по возрастанию
print(list_)

list_.sort(reverse = True) # сортировка по убыванию
print(list_)

#list_. + CTRL + ПРОБЕЛ = показывает все методы!!!!