import math
#math.trunc(32.3) отсекает дробную часть числа, в том числе у отрицательных
print(math.trunc(32.3))
print(int(89.5554))  # аналогично отсекает дробную часть
# math.floor(32.1) ОКРУГЛЕНИЕ ВНИЗ наибольшее целое число, которое не превосходит вещественное ( при отрицательных сдвиг влево!)
print(math.floor(32.1))
# math.ceil(4.5) ОКРУГЛЕНИЕ ВВЕРХ наибольшее целое число, которое превосходит вещественное ( если дробной части нет - получаем само число, при отрицательных сдвиг вправо!)
print(math.ceil(4.5))
